#include <iostream>
using namespace std;

/*
* 問題文：
* 「こんにちは。」と出力する関数helloを作成せよ
*/

void hello();

/*============================================================
* メイン関数
* 引数　：なし
* 戻り値：なし
============================================================*/
int main() {

	// hello関数を使用する
	hello();
}

/*============================================================
*  「こんにちは。」と出力する関数
* 引数　：なし
* 戻り値：なし
============================================================*/
void hello() {

	//「こんにちは。」と出力する
	cout << "こんにちは。\n";

}
