#include <iostream>
using namespace std;

/*
* 問題文：
* 指定された付きの季節を表示する関数print_seasonを作成せよ
* 春：３，４，５
* 夏：６，７，８
* 秋：９、１０、１１
* 冬：１２、１、２
* 上記以外は何も表示しない
*/

void print_season(int m);

/*============================================================
* メイン関数
* 引数　：なし
* 戻り値：なし
============================================================*/
int main() {

	// 季節の変数を宣言
	int m;

	// 季節を入力する
	cout << "月を入力してください\n";
	cin >> m;

	// 引数で受け取った月をもとに、季節を出力する関数を使用する
	print_season(m);
}

/*============================================================
*  引数で受け取った月をもとに、季節を出力する関数
* 引数　：int m			月
* 戻り値：なし
============================================================*/
void print_season(int m) {

	switch (m){
		case 3: case 4: case 5:
			cout << "季節は春です。\n";
			break;
		case 6: case 7: case 8:
			cout << "季節は夏です。\n";
			break;
		case 9: case 10: case 11:
			cout << "季節は秋です。\n";
			break;
		case 12: case 1: case 2:
			cout << "季節は冬です。\n";
			break;
	}
}
