#include <iostream>
using namespace std;

/*
* 問題文：
* 半径rの円の面積を求めて返却する関数circ_areaを作成せよ。円周率は3.14とする。
*/

double circ_area(double r);

/*============================================================
* メイン関数
* 引数　：なし
* 戻り値：なし
============================================================*/
int main() {

	// 半径の変数を宣言
	double r;

	// 半径を入力する
	cout << "半径を入力してください\n";
	cin >> r;

	// 円の面積を求める関数の使用
	// 結果を出力する
	cout << "円の面積は " << circ_area(r) << " です。\n";
}

/*============================================================
* 半径を受け取り、円の面積を出力する関数
* 引数　：int r			半径
* 戻り値：int			面積
============================================================*/
double circ_area(double r) {

	// 円の面積の変数宣言
	double area;

	//円の面積を求める
	area = r * r * 3.14;

	//円の面積を返却する
	return area;
}