#include <iostream>
#include <iomanip>
using namespace std;

/*
* 問題文：
* int*型のポインタpを、int[5]型の配列aの先頭要素を指すように初期化したうえで、
* aとpに対して間接演算子*と添字演算子[]を適用した値を表示するプログラムを作成せよ。
*/


/*============================================================
* メイン関数
* 引数　：なし
* 戻り値：なし
============================================================*/
int main() {

	// int[5]型配列aの初期化
	int a[5] = { 1,2,3,4,5 };

	// int*型ポインタpの初期化
	int* p = a;

	// 値の出力
	cout << setw(8) << "*a: " << *a << "\n";
	cout << setw(8) << "a[0] : " << a[0] << "\n";
	cout << setw(8) << "*p: " << *p << "\n";
	cout << setw(8) << "p[0] : " << p[0] << "\n";

	cout << "---------------------\n";

	cout << setw(12) << "*(a + 1): " << *(a + 1) << "\n";
	cout << setw(12) << "a[1] : " << a[1] << "\n";
	cout << setw(12) << "*(p + 1): " << *(p + 1) << "\n";
	cout << setw(12) << "p[1] : " << p[1] << "\n";
}