#include <iostream>
using namespace std;

/*
* 問題文：
* 要素数nの配列aの全要素の合計を求めて返却する関数sum_ofを作成せよ
*/

int sum_of(int a[], int n);

/*============================================================
* メイン関数
* 引数　：なし
* 戻り値：なし
============================================================*/
int main() {

	// 配列の要素数変数の初期化
	const int n = 5;

	// int型配列の初期化
	int a[] = { 10,2,3,40,5 };

	// forで先頭から最後まで走査して、現在の配列の要素を出力する
	for (int i = 0; i < n; i++) {
		cout << "a[" << i << "] = " << a[i] << "\n";
	}
	cout << "\n";

	// 要素数nの配列aの全要素の合計を求めて返却する関数の使用
	// 合計を出力する
	cout << "配列aの合計：　" << sum_of(a, n) << "\n";

}

/*============================================================
* 要素数nの配列aの全要素の合計を求めて返却する関数
* 引数　：int a[]		要素の合計を求める対象の配列
* 引数　：int n			配列の要素数
* 戻り値：int			合計
============================================================*/
int sum_of(int a[], int n) {

	// 合計を格納する変数の初期化
	int sum = 0;

	// forで最初から最後まで走査して、要素の総和を求める
	for (int i = 0; i < n; i++) {
		sum += a[i];
	}

	//合計を返却する
	return sum;
}
