#include <iostream>
using namespace std;

/*
* 問題文：
* 要素nの配列pの全要素にvを代入する関数fillを作成せよ。
* 仮引数の配列はポインタを使用すること。
*/

void fill(int* a, int n, int v);

/*============================================================
* メイン関数
* 引数　：なし
* 戻り値：なし
============================================================*/
int main() {

	const int n = 6;	// 配列の要素数
	int p[n];			// 配列pの宣言
	int v = 5;			// 配列の要素に代入する値

	// 要素nの配列pの全要素にvを代入する関数の使用
	fill(p, n, v);

	// 配列の要素の出力
	for (int i = 0; i < n; i++) {
		cout << p[i] << "\n";
	}
}

/*============================================================
* 要素nの配列pの全要素にvを代入する関数
* 引数　：int a[][5]		表示する対象の行列
* 引数　：int n				行列の行数
* 戻り値：なし
============================================================*/
void fill(int* p, int n, int v) {

	// 配列pをfor文で先頭から最後まで走査して、全要素にvを代入する
	for (int i = 0; i < n; i++) {
		*(p + i) = v;
	}
}
