#include <iostream>
#include <iomanip>
using namespace std;

/*
* 問題文：
* n行5列のint型2次元配列aの全構成要素の値を縦横に並べて表示する関数print2dを作成せよ。
* 各列の数値の先頭(左端)がそろうように、最低限のスペースを空けること。
*/

void print2d(int a[][5], int n);

/*============================================================
* メイン関数
* 引数　：なし
* 戻り値：なし
============================================================*/
int main() {

	// 行数の初期化、配列mの宣言
	const int n = 4;
	int m[n];

	// 行列の宣言
	int a[n][5];

	// 行列の各成分へ値を代入
	for (int i = 0; i < n; i++) {
		for (int j = 0; j < 5; j++) {
			a[i][j] = j + i * 5;
		}
	}

	// n行5列のint型2次元配列aの全構成要素の値を縦横に並べて表示する関数の使用
	print2d(a, n);
}

/*============================================================
*  n行5列のint型2次元配列aの全構成要素の値を縦横に並べて表示する関数
* 引数　：int a[][5]		表示する対象の行列
* 引数　：int n				行列の行数
* 戻り値：なし
============================================================*/
void print2d(int a[][5], int n) {

	// 行列を出力する
	for (int i = 0; i < n; i++) {
		for (int j = 0; j < 5; j++) {
			cout << setw(3) << left << a[i][j];
		}
		cout << "\n";
	}
	cout << "\n";
}
