#include <iostream>
using namespace std;

/*
* 問題文：
* 文字列sの全文字を先頭から順に1行に1文字ずつ表示する関数putvを作成せよ
*/

void putv(const char[]);

/*============================================================
* メイン関数
* 引数　：なし
* 戻り値：なし
============================================================*/
int main() {

	// 文字列sの初期化
	char s[] = "abcdefg";

	// 文字列sの全文字を先頭から順に1行に1文字ずつ表示する関数の使用
	putv(s);

}

/*============================================================
* 文字列sの全文字を先頭から順に1行に1文字ずつ表示する関数
* 引数　：const char s[]		// 文字表示対象の文字列
* 戻り値：なし
============================================================*/
void putv(const char s[]) {

	// 先頭から順に1行に1文字ずつ表示する
	for (int i = 0; s[i] != '\0'; i++) {
		cout << s[i] << "\n";
	}
}
