#include <iostream>
using namespace std;

/*
* 問題文：
* 文字列中の大文字を小文字に変換したうえで表示する関数put_lowerを作成せよ。
*/

void put_lower(const char s[]);

/*============================================================
* メイン関数
* 引数　：なし
* 戻り値：なし
============================================================*/
int main() {

	// 文字列を初期化する
	char s[] = "abcDEfGhIJklMN";

	// 文字列中の大文字を小文字に変換したうえで表示する関数を使用する
	put_lower(s);

}


/*============================================================
* 文字列中の大文字を小文字に変換したうえで表示する関数
* 引数　：char s[]		// 操作対象の文字列
* 戻り値：なし
============================================================*/
void put_lower(const char s[]) {

	// for文で先頭から最後まで文字を走査する。
	// tolowerで小文字にし、coutで出力する。
	for (int i = 0; s[i] != '\0'; i++) {
		cout << static_cast<char>(tolower(s[i]));
	}
}