#include <iostream>
using namespace std;

/*
* 問題文：
* 標準ライブラリstrcpy関数と同等な関数を作成せよ。
* 
* strcpy関数はs2が指す文字列を、s1が指す配列にコピーする。
*/

char* strcpy(char s1[], char s2[]);

/*============================================================
* メイン関数
* 引数　：なし
* 戻り値：なし
============================================================*/
int main() {

	char s1[10];			// コピー先の文字列
	char s2[] = "abcdefg";	// コピー元の文字列

	// コピー元s2の出力
	cout << "コピー元の文字列：" << s2 << "\n";

	// s2が指す文字列を、s1が指す配列にコピーする関数の使用
	strcpy(s1, s2);


	// コピー先s2の出力
	cout << "コピーされたの文字列：" << s1 << "\n";
}

/*============================================================
* s2が指す文字列を、s1が指す配列にコピーする関数
* 引数　：char s1[]		// コピー先の配列
* 引数　：char s2[]		// コピー元の配列
* 戻り値：char			// s1のポインタ
============================================================*/
char* strcpy(char s1[], char s2[]) {

	// for文で先頭からnull文字が出てくるまで走査する
	// s2を1文字ずつ、s1の要素に代入する。
	int i = 0;
	for (; s2[i] != '\0'; i++) {
		s1[i] = s2[i];
	}

	// s1の末尾にNULL文字を加える
	s1[i] = '\0';

	return s1;
}