#include <iostream>
using namespace std;

int length(const char str[]);

/*============================================================
* メイン関数
* 引数　：なし
* 戻り値：なし
============================================================*/
int main() {
	
	char str[20];
	int len;

	//文字数を調べる対象となる文字列を入力する
	cout << "文字列を入力してください。\n";
	cin >> str;

	//length関数を用いて、文字列の長さを調べる
	len = length(str);
	
	//結果を出力する
	cout << "文字列の長さは" << len << "です。\n";
}

/*============================================================
* 文字列の長さを調べる関数
* 引数　：const char str[]		文字数を調べる対象の文字列
* 戻り値：int					文字数
============================================================*/
int length(const char str[]) {

	//文字数を調べる
	//対象の文字列の最初から最後まで調べる。null文字が出てきたら終了する
	int i = 0;
	while (str[i] != '\0') {
		i++;	//文字数カウントを1つ増やし、文字列を1つ進める。
	}

	//文字列の長さを返却する
	return i;
}
